lccc233/CAN-WIFI/sdkconfig.defaults
# CAN-WIFI project defaults (applied on full sdkconfig regeneration)
CONFIG_IDF_TARGET="esp32s3"

# ---- Flash (16MB, DIO 80MHz) ----
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# ---- PSRAM: N16R8 module, octal 8MB ----
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
# Allocate WiFi/LWIP buffers from PSRAM first
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
